{
    "hallway": {
        "title": "hallway",
        "description": {
            "nullHallway": "You go back to the hallway, no items, no way out.\nYou need to figure out your next move or else you are going to be stuck here.\nMight be good to make sure you are thorough with your searching.",
            "bucket": "You are in the hallway, the door is firmly shut behind you, no way out!!\nThree rooms lie ahead of you, The Kitchen, Dining Room and Living Room.\nSmoke is flooding the hall and it seems to be coming from the kitchen.",
            "coffee mug": "The door remains firmly shut and the smoke has vanished.\nYou hope to get out of this place soon, it's so lame in here.\nFrom the Dining room you hear the sounds of a grumpy tired muppet.",
            "cat-nip": "You hear a loud MEEOWW from the Living Room.",
            "dice": "Your mind wanders to the mysteries of the basement, if only you knew the code for the door...."
        },
        "exit": ["kitchen", "living room", "dining room"],
        "complete": false
    },
    
    "kitchen":{
        "title": "kitchen",
        "objectives":{
            "check complete":{
                "useItem": "bucket",
                "completed":"You toss the watery contents of the bucket on the flames.\nThe yellow light flickers and sizzles away.\nThe dog smiles at you and tips his hat, as his apparition disappears.\nHis hat falls to the ground and his coffee mug sits on the table unattended",
                "incomplete":"As many flames as there are, it seems reasonable that say...\nPerhaps, a bucket-full of water might work to douse them",
                "complete": false
            },
            "itemFound": {
                "incomplete": "On the table sits the half full coffee mug.\nThe sweet aroma reminds you of grandma's coffee.",
                "complete": false
            },
            "clueFound":{
                "incomplete" : "The flames are gone, and you look around the charred kitchen\nThe dog's sweet fedora is lying on the ground in front of the table.\nPast the table the basement door lies ahead of you.",
                "complete" : false
            }
        },
        "description": {
            "memeComplete" : "The charred walls of the kitchen remind you of the odd scene you saw here\n Nothing is left but the basement door... taunting you to open and discover the mysteries within...",
            "memeIncomplete" : "You enter the kitchen and see flames, flames everywhere!!\nIn the middle of the room sits a dog wearing a sweet fedora sitting in a chair.\nNext to him is a piping hot mug of coffee.\nHe rocks back and forth muttering to himself 'This is fine, this is fine'"
        },
        "items":{
            "coffee mug":{
                "prereq": "check complete",
                "type": "misc",
                "description": "The coffee mug has the words worlds greatest.... with the rest of the words smudged away, it is half full of piping hot coffee.",
                "prereqMet":"You reach out and grab the mug, you carefully stash it in your bag.\nYou notice that the coffee doesn't spill out but stays perfectly level no matter what way you move it... neat...",
                "prereqNotMet":"The flames seem to get more angry. As you reach out for the mug the dog stands\nWith anger in his eyes he whispers 'Everything is not okay', and you are filled with an existential dread\nYour emotional damage leads you to slowly expire surrounded by etherial flames.\nIf only you had put out the fire..."
            },
            "fedora": {
                "prereq": "check complete",
                "type": "clue",
                "description": "That's one cool cap!\nIt may fit you but you would have to get it to check out the tag for the size.",
                "prereqMet":"You look and see a faint scribble on the inner brim of the fedora, 'Door Code: MR....'\nSome of the other characters have faded..",
                "prereqNotMet": "You try to yank the fedora off the dog.\nLooks like that was the straw that broke the camel's back\n'NOT OKAY DUDE' he yells... your people pleasing heart is broken, you die from that heartbreaking emotional damage"
            }
        },
        "exit": ["hallway", "basement"],
        "complete": false
    },

    "livingroom": {
        "title": "living room",
        "description": {
            "memeComplete" : "The cat in the room seems to be happy. He no longer is staring you down. \"So many reasons to be grumpy, so little time off I go.\"\n -Cat", 
            "memeIncomplete" : "You enter and feel a presence slightly judging you. \n I had fun once.. it was awful.\n -Cat"
        },
        "objectives": {
            "check complete": {
                "useItem" : "cat nip",
                "completed": "You give the cat catnip, he seems to be less grumpy.",
                "incomplete": "I think this grumpy cat needs something, we should get cat-nip for the cat!",
                "complete" : false
            },
            "clueFound":{
                "completed" : "There's a sticky note with \"Password = *23*\".",
                "incomplete" : "I should search the desk to find some clues.",
                "complete" : false
            }
        },
        "items": {
            "Dice": {
                "prereq": "check complete",
                "description": "My dice don't jiggle jiggle they roll.",
                "prereqMet": "You got the dice off the desk, they aren't your normal six sided die.\nOne has the number 20 on it, we should look around to see what we can use them for.",
                "prereqNotMet": "As you reach for the dice the cat turns it's grumpy face towards you\nHe says 'Like a good neighbor, you should have stayed over there'\nA single tear falls down your face and the Emotional Damage sinks in."
            }
        },
        "exit": ["hallway"],
        "complete": false
    },

    "diningroom": {
        "title": "dining room",
        "description": {
            "memeIncomplete": "You enter the dining room and oddly sitting at the head of the table is Kermit the Frog.\nKermit seems groggy and turns to give you a blank stare.\nHe looks forward and mumbles 'That's not my business'.",
            "memeComplete": "Kermit is no longer here all you see is the dining table and chandelier"
        },
        "objectives": {
            "check complete": {
                "useItem": "coffee mug",
                "completed":"Kermit accepts your offering, and sips his coffee.\nHe slaps his knees and says 'Welp, better head out' and leaves the room",
                "incomplete": "At the foot of the table you notice a small bowl.\nFrom your cat wrangling days, you recognize what looks to be some primo cat nip rested in the bowl\nAbove you is a chandelier with an odd number of dangling jewels.",
                "complete": false
            },
            "clueFound": {
                "completed": "There are 7 jewels hanging from the Chandelier, you keep a mental note of the number 7",
                "incomplete": "Have a closer look at the chandelier",
                "complete": false
            }
        },
        "items": {
            "cat nip": {
                "prereq": "check complete",
                "description": "The most exquisite, finely plated catnip to exist in the metaverse",
                "prereqMet": "You carefully grab the plate so as to not disturb the aesthetics of the catnip and place it into your inventory.",
                "prereqNotMet": "You reach for the plate of exquisite catnip when Kermit snaps his neck to glare at you...\nKermit starts to mumble and your hands stops before reaching the plate...\n 'You... G... Succeed...' Kermit continues to stare into your soul and speaks clearly,\n'Really breh? It seems you wont go too far in life. How you gonna get stuck in a haunted house and not even consider breaking the walls or windows first?\n Can you even think? You probably a B rated student at best, B for BELOW AVERAGE. Get gud kid.\n...You die from emotional damage."
            }
        },
        "exit": ["hallway"],
        "complete": false
    }
} 
